export function baseDefault() {
  return   "          <h2>1.是不是好生意</h2>\n" +
    "          1.1怎么赚钱：<br>\n" +
    "            1.1.1商业模式<br>\n" +
    "            1.1.2经营模式:采购,生产,销售<br>\n" +
    "              *主营业务收入构成:<br>\n" +
    "            1.1.3.成本构成:<br>\n" +
    "          1.2能不能持续：护城河<br>\n" +
    "          1.3能不能增长：<br>\n" +
    "\n" +
    "\n" +
    "          <h2>2.现金流状况</h2>\n" +
    "\n" +
    "          <h2>3.关键财务指标分析</h2>\n" +
    "\n" +
    "          <h3>3.1安全性</h3>\n" +
    "\n" +
    "          <h3>3.2盈利能力分析</h3>\n" +
    "\n" +
    "          <h3>3.3成长性:</h3>\n" +
    "\n" +
    "          <h3>3.4管理能力:在一个固定周期,对企业资源的利用次数</h3>\n" +
    "\n" +
    "          <h2>4.行业竞争格局和公司的比较优势</h2>\n" +
    "\n" +
    "          <h2>5.股权结构,散户数量</h2>"
}

export function trendReminder() {
  return "          <h2>买入</h2>\n" +
    "          1. 为什么认为一家公司便宜( 估值水平与同业比，与历史比，市值大小与未来成长空间比，pe市盈率，roe，市盈增长比) <br>\n"+
    "          2. 以及为什么要现在买（ 盈利超预期，高管增持，跌不动了，基本面拐点，新订单等催化剂 ） <br>\n"+
    "          3. 注意筹码结构, 尽量买在筹码峰下方<br>\n" +
    "          <h2>卖出</h2>\n" +
    "          1. 长期逻辑, 底部格局, 成长逻辑兑现, 高位破5周线跑路<br>\n" +
    "          2. 中期逻辑, 需要有实际资金支持, 破5日线跑<br>\n" +
    "          3. 短期逻辑, 概念炒作, 成交量异常跑, 放量滞涨<br>"
}

export function baseReminder() {

  return"基本面判断\n" +
    "          <h2>1.是不是好生意</h2>\n" +
    "          1.怎么赚钱：波特五力模型<br>\n" +
    "            1.1商业模式<br>\n" +
    "            1.2.经营模式:采购,生产,销售,招股说明书中有<br>\n" +
    "              *主营业务收入构成<br>\n" +
    "            1.3.成本构成:生产工艺流程<br>\n" +
    "              *原材料及设备(折旧算成本)<br>\n" +
    "          2.能不能持续：护城河<br>\n" +
    "          3.能不能增长：行业阶段及企业所处行业位置<br>\n" +
    "          <h2> 2.现金流状况</h2>,做生意的最终目的就是赚取现金流<br>\n" +
    "          <h2>3.关键财务指标分析</h2>\n" +
    "\n" +
    "          <h3>安全性</h3>\n" +
    "\n" +
    "          <p>*流动比率=流动资产/流动负债,2左右比较理想<br>\n" +
    "            *速动比率=速动资产/流动负债,1左右<br>\n" +
    "            *速动资产=流动资产-存货<br>\n" +
    "            *现金债务比=现金及现金等价物/有息负债&gt;=1</p>\n" +
    "\n" +
    "          <h3>盈利能力分析</h3>\n" +
    "\n" +
    "          <p>*营业收入视角:营业收入有多少可以转化为利润<br>\n" +
    "               *营业利润率=(营业收入-营业成本-三费)/营业收入<br>\n" +
    "               *毛利率=(营业收入-营业成本)/营业收入  高毛利率意味着产品难以被替代<br>\n" +
    "               *净利率=净利润/营业收入<br>\n" +
    "                  * 净利润：营业利润+营业外收支净额，缴纳所得税后，剩下的就是净利润\n<br>\n" +
    "             *资产视角:股东投入加有息负债产生多少利润<br>\n" +
    "               *净资产收益率=净利润/平均净资产<br>\n" +
    "               *总资产收益率=净利润/平均总资产<br>\n" +
    "               *总资产收益率:考虑杠杆因素<br>\n" +
    "               *平均净资产和总资产可以简单的用期初与期末之和除2<br>\n" +
    "               *经济商誉:同样的净资产能够赚取更多的净利润,金钱填不平的护城河,ROE就是这个指标<br>\n" +
    "               *(净资产+商誉)*无风险收益率=净利润=净资产*ROE</p>\n" +
    "\n" +
    "          <h3>成长性:</h3>\n" +
    "\n" +
    "          <p>*收入<br>\n" +
    "               *营收增长率<br>\n" +
    "               *营业利润增长率<br>\n" +
    "            *资产<br>\n" +
    "               *资产增长率<br>\n" +
    "               *净资产增长率</p>\n" +
    "\n" +
    "          <h3>管理能力:在一个固定周期,对企业资源的利用次数</h3>\n" +
    "\n" +
    "          <p>*应收账款周转率=营业收入/平均应收账款,越高说屏账款回收速度越快,同时看是否影响了营业收入<br>\n" +
    "               *平均营收账款=(期初+期末应收账款)/2<br>\n" +
    "            *存货周转率=营业成本/存货平均余额,反映存货利用情况,越高存货占用的资金越少,太高意味着可能出现断货,存货会贬值与会增值的企业也会有天壤之别<br>\n" +
    "            *固定资产周转率=营业收入/固定资产净值,反映企业属于重资产还是轻资产企业<br>\n" +
    "            *总资产周转率=营业收入/平均总资产,同样的资产利用效率更高,管理层能力越强<br>\n" +
    "          </p>\n" +
    "          <h2>4.行业竞争格局和公司的比较优势</h2>\n" +
    "          1.市场前景：人口*渗透率*单价*更换频次<br>\n" +
    "          2.自己能够为客户提供哪些不可比拟的价值，以及相对于竞争对手的比较竞争优势在哪里。<br>\n" +
    "          *竞争优势：定价权，收入可控,成本可控<br>\n" +
    "          <h2>5.股权结构,散户数量</h2>"

}
